In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('Salary_Data.csv')

In [4]:
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [5]:
df.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [6]:
df.isnull().any()

YearsExperience    False
Salary             False
dtype: bool

In [7]:
df.shape

(30, 2)

In [8]:
from sklearn.model_selection import train_test_split # to split the data into two parts

In [9]:
train, test = train_test_split(df,test_size=0.30)

In [10]:
train.shape

(21, 2)

In [11]:
test.shape

(9, 2)

In [12]:
train.head

<bound method NDFrame.head of     YearsExperience    Salary
7               3.2   54445.0
17              5.3   83088.0
14              4.5   61111.0
24              8.7  109431.0
12              4.0   56957.0
6               3.0   60150.0
19              6.0   93940.0
4               2.2   39891.0
23              8.2  113812.0
16              5.1   66029.0
26              9.5  116969.0
21              7.1   98273.0
0               1.1   39343.0
25              9.0  105582.0
5               2.9   56642.0
15              4.9   67938.0
18              5.9   81363.0
28             10.3  122391.0
8               3.2   64445.0
9               3.7   57189.0
2               1.5   37731.0>

In [13]:
train.head()

    YearsExperience    Salary
7               3.2   54445.0
17              5.3   83088.0
14              4.5   61111.0
24              8.7  109431.0
12              4.0   56957.0

In [14]:
test.head()

    YearsExperience    Salary
3               2.0   43525.0
1               1.3   46205.0
10              3.9   63218.0
29             10.5  121872.0
13              4.1   57081.0

In [15]:
df.info

<bound method DataFrame.info of     YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0>

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
YearsExperience    30 non-null float64
Salary             30 non-null float64
dtypes: float64(2)
memory usage: 560.0 bytes

In [17]:
features=['YearsExperience']

In [18]:
target=['Salary']

In [19]:
#Fill the training and test data with require information
X_train = train[features]
y_train = train[target]
X_test = test[features]
y_test = test[target]

In [20]:
X_train

    YearsExperience
7               3.2
17              5.3
14              4.5
24              8.7
12              4.0
6               3.0
19              6.0
4               2.2
23              8.2
16              5.1
26              9.5
21              7.1
0               1.1
25              9.0
5               2.9
15              4.9
18              5.9
28             10.3
8               3.2
9               3.7
2               1.5

In [21]:
from sklearn import linear_model# compute classification accuracy for the linear regression model
from sklearn import metrics # for the check the error and accuracy of the model
lin = linear_model.LinearRegression()
# train the model on the training set
lin.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [22]:
lin_score_train = lin.score(X_train, y_train)
lin_score_test = lin.score(X_test, y_test)

In [23]:
print("Training score: ",lin_score_train)
print("Testing score: ",lin_score_test)

Training score:  0.9514832944741001
Testing score:  0.9640277143055545

In [25]:
print("Git Test")

Git Test